# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [49]:
import pandas as pd

In [50]:
import numpy as np

In [51]:
df = pd.read_excel('nir.xlsx')

In [52]:
df

  Student/Subject  math  science  history  geography
0           Virat    45       48       47         46
1           Rohit    66       55       44         33
2            Ravi    22       44       55         33

In [53]:
df['math']

0    45
1    66
2    22
Name: math, dtype: int64

In [54]:
df[['Student/Subject','history']]

  Student/Subject  history
0           Virat       47
1           Rohit       44
2            Ravi       55

In [55]:
df.geography

0    46
1    33
2    33
Name: geography, dtype: int64

In [56]:
type(df.geography)

pandas.core.series.Series

In [57]:
#creating new column
df['Total'] = df['math'] + df['science'] + df['history'] + df['geography']

In [58]:
df

  Student/Subject  math  science  history  geography  Total
0           Virat    45       48       47         46    186
1           Rohit    66       55       44         33    198
2            Ravi    22       44       55         33    154

In [59]:
#delete a column
df.drop('Total', axis = 1)

  Student/Subject  math  science  history  geography
0           Virat    45       48       47         46
1           Rohit    66       55       44         33
2            Ravi    22       44       55         33

In [60]:
df

  Student/Subject  math  science  history  geography  Total
0           Virat    45       48       47         46    186
1           Rohit    66       55       44         33    198
2            Ravi    22       44       55         33    154

In [61]:
df.drop('Total',axis=1,inplace=True)

In [62]:
df

  Student/Subject  math  science  history  geography
0           Virat    45       48       47         46
1           Rohit    66       55       44         33
2            Ravi    22       44       55         33

In [63]:
df['new'] = df['math'] + df['science']

In [64]:
df

  Student/Subject  math  science  history  geography  new
0           Virat    45       48       47         46   93
1           Rohit    66       55       44         33  121
2            Ravi    22       44       55         33   66

In [65]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [66]:
df.head()

  Student/Subject  math  science  history  geography  new
0           Virat    45       48       47         46   93
1           Rohit    66       55       44         33  121
2            Ravi    22       44       55         33   66

In [67]:
#delete a row
df.drop(labels=[0])

  Student/Subject  math  science  history  geography  new
1           Rohit    66       55       44         33  121
2            Ravi    22       44       55         33   66

In [68]:
df

  Student/Subject  math  science  history  geography  new
0           Virat    45       48       47         46   93
1           Rohit    66       55       44         33  121
2            Ravi    22       44       55         33   66

In [69]:
df.loc[0]

Student/Subject    Virat
math                  45
science               48
history               47
geography             46
new                   93
Name: 0, dtype: object

In [70]:
df.iloc[2]

Student/Subject    Ravi
math                 22
science              44
history              55
geography            33
new                  66
Name: 2, dtype: object

In [41]:
df_new = pd.read_csv('test.csv')
df_new

    A   B   C   D
0  40  48  47  46
1  30  55  44  33
2  20  44  55  33

In [42]:
#condition rule which gives output in true/false
df_new > 33

       A     B     C      D
0   True  True  True   True
1  False  True  True  False
2  False  True  True  False

In [44]:
df_new[df_new['A']>20]

    A   B   C   D
0  40  48  47  46
1  30  55  44  33

In [84]:
#creating dataframe by giving data from here
index = ['W','X','Y','Z']
data = {'A':[23,33,43,53],
        'B':[24,34,34,54],
        'C':[12,13,14,15],
        'D':[22,32,45,56]}

new = pd.DataFrame(data, index)
new

    A   B   C   D
W  23  24  12  22
X  33  34  13  32
Y  43  34  14  45
Z  53  54  15  56

In [85]:
new.loc[['X','Y'],['A','B']]

    A   B
X  33  34
Y  43  34

In [86]:
new.loc['Y','B']

34

In [89]:
new

    A   B   C   D
W  23  24  12  22
X  33  34  13  32
Y  43  34  14  45
Z  53  54  15  56

In [90]:
new>6

      A     B     C     D
W  True  True  True  True
X  True  True  True  True
Y  True  True  True  True
Z  True  True  True  True

In [91]:
new[new['A']>30]

    A   B   C   D
X  33  34  13  32
Y  43  34  14  45
Z  53  54  15  56

In [92]:
new[new['A']>0]['C']

W    12
X    13
Y    14
Z    15
Name: C, dtype: int64

In [94]:
new[(new['A']>33) & (new['B'] > 30)]

    A   B   C   D
Y  43  34  14  45
Z  53  54  15  56

In [100]:
newind = 'CA NY WY NY'.split()

In [101]:
#creating new column and the values are given above
new['col3'] = newind

In [102]:
new

    A   B   C   D col3
W  23  24  12  22   CA
X  33  34  13  32   NY
Y  43  34  14  45   WY
Z  53  54  15  56   NY

In [103]:
#reset index
new.set_index(['D'], inplace = True)
new

     A   B   C col3
D
22  23  24  12   CA
32  33  34  13   NY
45  43  34  14   WY
56  53  54  15   NY

In [105]:
# reset index without removing default index
new.reset_index(level =['D'], inplace = True)
new

    D   A   B   C col3
0  22  23  24  12   CA
1  32  33  34  13   NY
2  45  43  34  14   WY
3  56  53  54  15   NY

## Multi-Indexing

In [107]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [108]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [109]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.941394 -0.048009
   2  0.780949 -1.013808
   3 -1.311502  0.056824
G2 1  0.885729 -1.127865
   2 -0.925873  0.315764
   3 -0.627461 -1.226430

In [110]:
df.loc['G1']

          A         B
1  0.941394 -0.048009
2  0.780949 -1.013808
3 -1.311502  0.056824

In [111]:
df.loc['G1'].loc[1]

A    0.941394
B   -0.048009
Name: 1, dtype: float64

In [112]:
df.index.names

FrozenList([None, None])

In [113]:
df.index.names = ['Group','Number']

In [114]:
df

                     A         B
Group Number
G1    1       0.941394 -0.048009
      2       0.780949 -1.013808
      3      -1.311502  0.056824
G2    1       0.885729 -1.127865
      2      -0.925873  0.315764
      3      -0.627461 -1.226430

In [115]:
df.xs('G1')

               A         B
Number
1       0.941394 -0.048009
2       0.780949 -1.013808
3      -1.311502  0.056824

In [116]:
df.xs(['G1',1])

A    0.941394
B   -0.048009
Name: (G1, 1), dtype: float64

In [118]:
df.xs(1,level='Number')

              A         B
Group
G1     0.941394 -0.048009
G2     0.885729 -1.127865